---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation
source: html/bb27708f-110c-f59b-3056-b8c45eabe5f6.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation

Describes how the Bending Detail will represent the bar segments.

## Syntax (C#)
```csharp
public enum BendingDetailSegmentsRepresentation
```